use MusicShop;

insert into brands (brand)
values ('Aria'),
       ('Cort'),
       ('Crafter'),
       ('Doff'),
       ('Gibson'),
       ('Squier'),
       ('Yamaha'),
       ('АмистарИКомпания'),
       ('Forte'),
       ('DAddario'),
       ('Earthwood'),
       ('Medinaartigas'),
       ('Вязальная_проволока');

insert into strings (brand_id, model, price)
values (9, '10-50', 340),
       (10, 'EJ27H', 550),
       (10, 'EXP13', 719),
       (10, 'EJ27N', 550),
       (11, '80-20', 464),
       (12, 'GCT-8', 800),
       (13, '2метра', 100);

insert into corpora(model, wood, fret_number, price)
values ('AD-MINI-OP', 'red', 20, 8912),
       ('AP550', 'mahoganies', 19, 10594),
       ('Jumbo', 'maple', 20, 16300),
       ('AD880CE-NAT', 'red', 20, 13452),
       ('Affinity', 'alder', 21, 15250),
       ('AD810-BKS', 'mahoganies', 20, 8071),
       ('Pacifica012', 'agathis', 22, 14090),
       ('LesPaulCustom', 'maple', 22, 253543),
       ('VL', 'maple', 4, 5580),
       ('VN', 'maple', 4, 6990),
       ('FV', 'alder', 3, 5700),
       ('А-21', 'Опилки', 19, 400);

insert into guitars (brand_id, string_id, corpus_id)
values (2, 05, 02),
       (2, 03, 02),
       (4, 02, 04),
       (2, 06, 06),
       (6, 01, 03),
       (7, 04, 01),
       (5, 06, 08),
       (1, 03, 07),
       (3, 02, 05),
       (7, 05, 07),
       (8, 07, 12);

insert into buyers (name, surname)
values ('Дмитрий', 'Гапонов'),
       ('Роман', 'Нарышкин'),
       ('Александр', 'Мунзиков'),
       ('Виктория', 'Нарышкина'),
       ('Илья', 'Иисус-Шилюкович'),
       ('Иван', 'Кочеров'),
       ('Ульяна', 'Кочерова'),
       ('Александр', 'Лазарев'),
       ('Элеонора', 'Пословская'),
       ('Артем', 'Лингвистов');

insert into guitars_trade (guitar_id, buyer_id, date)
values (3, 1, '2018-09-05'),
       (3, 4, '2018-10-08'),
       (1, 6, '2018-09-02'),
       (1, 3, '2018-09-19'),
       (5, 6, '2018-09-14'),
       (5, 10, '2018-09-25'),
       (7, 3, '2018-10-16'),
       (7, 6, '2018-11-16'),
       (2, 4, '2018-09-20'),
       (2, 7, '2018-10-16'),
       (8, 5, '2018-09-06'),
       (8, 9, '2018-11-04'),
       (8, 3, '2018-09-06'),
       (8, 5, '2018-11-06'),
       (4, 7, '2018-10-06'),
       (4, 9, '2018-12-01'),
       (6, 9, '2018-10-01'),
       (6, 10, '2018-10-01'),
       (9, 5, '2018-10-07'),
       (9, 1, '2018-10-18'),
       (10, 1, '2018-09-19'),
       (10, 7, '2018-11-09'),
       (7, 3, '2018-09-14'),
       (8, 9, '2018-10-20'),
       (3, 3, '2018-10-18'),
       (11, 2, '2018-11-25');